src/Documents/НазначениеОпросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>НазначениеОпросов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРеспондентов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозможностьПредварительногоСохранения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныйОпрос</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьВАрхивеАнкет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Респонденты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Респондент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Анкета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Анкета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтветыНаВопросыАнкет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемыйРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интервьюер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Интервьюер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонАнкеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныАнкет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимАнкетирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыАнкетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыШаблонаАнкеты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЯчейки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/АнкетированиеПлатформаСервер/Ext/Module.bsl
// Общий модуль "Анкетирование платформа (сервер)"


// Общий обработчик формирующий меню АнкетированиеКонтрагента
//
// Параметры:
//  Форма  - <УправляемаяФорма> - Форма документа, на котором необходимо разместить меню Анкетирование.
//  ИмяКоманднойПанелиФормы  - <Строка> - Имя панели, на которой необходимо разместить кнопку.
//
Процедура СформироватьМенюАнкетирование(Форма, ИмяКоманднойПанелиФормы = "ДополнительныеДействия", Знач Респондент = Неопределено) Экспорт

	// Проверим существование Подменю Анкеты
	СтруктураПроверка = Новый Структура;
	СтруктураПроверка.Вставить("ПодменюАнкеты", NULL);
	ЗаполнитьЗначенияСвойств(СтруктураПроверка, Форма.Элементы);
	ПодменюАнкетыНеСуществует = СтруктураПроверка.ПодменюАнкеты = NULL;
	Если ПодменюАнкетыНеСуществует Тогда
		// Создаем подменю анкеты
		ПодменюАнкеты = ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ПодменюАнкеты", ИмяКоманднойПанелиФормы,,  НСтр("ru = 'Анкеты'") , БиблиотекаКартинок.Опрос, НСтр("ru = 'Анкеты, доступные для заполнения'"),, ОтображениеКнопки.КартинкаИТекст);
	Иначе
		ПодменюАнкеты = СтруктураПроверка.ПодменюАнкеты;
		// Удаляем вложенные в подменю команды и кнопки
		Состав = Новый Структура();
		Состав.Вставить("МассивУдаляемыхКоманд", Новый Массив);
		Состав.Вставить("Форма", Форма);
		
		МассивУдаляемыхКнопок = Новый Массив;
		Для Каждого Элемент Из Форма.Элементы.ПодменюАнкеты.ПодчиненныеЭлементы Цикл
			РаботаВБезопасномРежиме.ВыполнитьВБезопасномРежиме("Параметры.МассивУдаляемыхКоманд.Добавить(Параметры.Форма.Команды." + Элемент.ИмяКоманды +")", Состав);
			МассивУдаляемыхКнопок.Добавить(Элемент);
		КонецЦикла;
		Для Каждого Команда Из Состав.МассивУдаляемыхКоманд Цикл
			Форма.Команды.Удалить(Команда);
		КонецЦикла;
		Для Каждого Кнопка Из МассивУдаляемыхКнопок Цикл
			Форма.Элементы.Удалить(Кнопка);
		КонецЦикла;
	КонецЕсли;
	Если ПодменюАнкеты = Неопределено Тогда
		ПодменюАнкеты = Форма.КоманднаяПанель;
	КонецЕсли;
	
	// Если респондент не задан, то присваиваем ему значение контрагент, в отсутствии такового прекращаем выполнение.
	Если НЕ ЗначениеЗаполнено(Респондент) Тогда
		Если ЕстьРеквизит(Форма,"РеспондентОпроса") И ЗначениеЗаполнено(Форма.РеспондентОпроса) Тогда
			Респондент = Форма.РеспондентОпроса;
		ИначеЕсли ЕстьРеквизит(Форма.Объект,"Контрагент") И ЗначениеЗаполнено(Форма.Объект.Контрагент) Тогда
			Респондент = Форма.Объект.Контрагент;
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Метаданные.ОпределяемыеТипы.Респондент.Тип.СодержитТип(ТипЗнч(Респондент)) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка, если ИмяКоманднойПанелиФормы задано не верно, то прекращаем выполнение.
	Если Форма.Элементы.Найти(ИмяКоманднойПанелиФормы) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим, в каком режиме выполнять проверку прав доступа к объектам анкетирования.
	ТекущийПользователь = ?(ПривилегированныйРежим(), ПользователиИнформационнойБазы.ТекущийПользователь(), Неопределено);
	
	// Проверка, если Нет прав на объекты анкетирования, то прекращаем выполнение
	Если  НЕ ПравоДоступа("Чтение",       Метаданные.Документы.НазначениеОпросов, ТекущийПользователь) 
		ИЛИ НЕ ПравоДоступа("Чтение",     Метаданные.Справочники.ШаблоныАнкет,    ТекущийПользователь) 
		ИЛИ НЕ ПравоДоступа("Добавление", Метаданные.Документы.Анкета, ТекущийПользователь) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверка, если не включена Функциональная Опция "ИспользоватьАнкетирование", то прекращаем выполнение.
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьАнкетирование") Тогда
		Возврат;
	КонецЕсли; 

	// Получим список доступных анкет, если анкет для респондента нет, прекращаем выполнение;
	ПолученнаяТаблицаАнкет = Анкетирование.ПолучитьТаблицуДоступныхРеспондентуАнкет(Респондент);
	Если ПолученнаяТаблицаАнкет = Неопределено И НЕ Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Форма.Объект.ссылка)) Тогда
		Возврат;
	КонецЕсли;                                                                                                              
	
	// Если по каким либо причинам не создан Реквизит Анкеты, прекращаем выполнение;
	Если НЕ ЕстьРеквизит(Форма,"Анкеты") Тогда
		Возврат
	КонецЕсли;
	
	// Создаем пункты подменю Анкеты
	Если НЕ ПолученнаяТаблицаАнкет = Неопределено Тогда
		Для каждого Анкета Из ПолученнаяТаблицаАнкет Цикл
			ИмяКоманды    = "КомандаАнкетирования" + Анкета.Владелец().Индекс(Анкета);
			ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, ИмяКоманды, ПодменюАнкеты.Имя, БиблиотекаКартинок.Опрос,Анкета.Наименование ,,Ложь ,,"Подключаемый_ОбработкаКомандыФормы",ОтображениеКнопки.КартинкаИТекст,,,Ложь, Истина);
			Форма.Анкеты.Добавить(Анкета.АнкетаОпрос);
		КонецЦикла; 
	КонецЕсли;
	
	// Для справочников добавим пункт "Архив Анкет"
	Если  Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(Форма.Объект.ссылка))  Тогда
		ИмяКоманды    = "АрхивАнкет";
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, ИмяКоманды, ПодменюАнкеты.Имя, БиблиотекаКартинок.Опрос,"Архив Анкет" ,,Ложь ,,"Подключаемый_ОбработкаКомандыФормы",ОтображениеКнопки.КартинкаИТекст,,,Ложь, Истина);
	КонецЕсли; 
	
КонецПроцедуры // ()

Процедура ЗаполнитьОрганизациюИПодразделения() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	НазначениеОпросов.Ссылка КАК Ссылка,
	               |	НазначениеОпросов.Автор.Организация КАК АвторОрганизация,
	               |	НазначениеОпросов.Автор.ПодразделениеКомпании КАК АвторПодразделениеКомпании
	               |ИЗ
	               |	Документ.НазначениеОпросов КАК НазначениеОпросов
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Анкета.Ссылка,
	               |	Анкета.Интервьюер.Организация,
	               |	Анкета.Интервьюер.ПодразделениеКомпании
	               |ИЗ
	               |	Документ.Анкета КАК Анкета";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДокументАнкетирования = Выборка.Ссылка.ПолучитьОбъект();
		
		Если НЕ ЗначениеЗаполнено(ДокументАнкетирования.ПодразделениеКомпании) Тогда
			Если ЗначениеЗаполнено(Выборка.АвторПодразделениеКомпании) Тогда 
				ДокументАнкетирования.ПодразделениеКомпании = Выборка.АвторПодразделениеКомпании;
			Иначе
				ДокументАнкетирования.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДокументАнкетирования.Организация) Тогда
			Если ЗначениеЗаполнено(Выборка.АвторОрганизация) Тогда
				ДокументАнкетирования.Организация = Выборка.АвторОрганизация;
			Иначе
				ДокументАнкетирования.Организация = ПараметрыСеанса.Организация;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьРеквизит(ДокументАнкетирования,"Автор") И НЕ ЗначениеЗаполнено(ДокументАнкетирования.Автор) Тогда
			ДокументАнкетирования.Автор = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		ДокументАнкетирования.ОбменДанными.Загрузка = Истина;
		Попытка
			ДокументАнкетирования.Записать();
			ВывестиСообщение(НСтр("ru='Обновлен документ ""%1"".'"),,,,, СокрЛП(ДокументАнкетирования.Ссылка));
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Не удалось обновить документ анкетирования'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
